Pansamic/ros2car_mspm0/Config/firmware.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "MSPM0G350X" --part "Default" --package "LQFP-64(PM)" --product "mspm0_sdk@2.03.00.07"
 * @v2CliArgs --device "MSPM0G3507" --package "LQFP-64(PM)" --product "mspm0_sdk@2.03.00.07"
 * @versions {"tool":"1.22.0+3893"}
 */
scripting.excludeFromBuild("Event.dot");

/**
 * Import the modules used in this configuration.
 */
const ADC12         = scripting.addModule("/ti/driverlib/ADC12", {}, false);
const ADC121        = ADC12.addInstance();
const DMA           = scripting.addModule("/ti/driverlib/DMA");
const GPIO          = scripting.addModule("/ti/driverlib/GPIO", {}, false);
const GPIO1         = GPIO.addInstance();
const GPIO2         = GPIO.addInstance();
const GPIO3         = GPIO.addInstance();
const GPIO4         = GPIO.addInstance();
const GPIO5         = GPIO.addInstance();
const I2C           = scripting.addModule("/ti/driverlib/I2C", {}, false);
const I2C1          = I2C.addInstance();
const I2C2          = I2C.addInstance();
const PWM           = scripting.addModule("/ti/driverlib/PWM", {}, false);
const PWM1          = PWM.addInstance();
const PWM2          = PWM.addInstance();
const PWM3          = PWM.addInstance();
const PWM4          = PWM.addInstance();
const PWM5          = PWM.addInstance();
const RTC           = scripting.addModule("/ti/driverlib/RTC");
const SPI           = scripting.addModule("/ti/driverlib/SPI", {}, false);
const SPI1          = SPI.addInstance();
const SPI2          = SPI.addInstance();
const SYSCTL        = scripting.addModule("/ti/driverlib/SYSCTL");
const SYSTICK       = scripting.addModule("/ti/driverlib/SYSTICK");
const TIMER         = scripting.addModule("/ti/driverlib/TIMER", {}, false);
const TIMER1        = TIMER.addInstance();
const UART          = scripting.addModule("/ti/driverlib/UART", {}, false);
const UART1         = UART.addInstance();
const UART2         = UART.addInstance();
const UART3         = UART.addInstance();
const ProjectConfig = scripting.addModule("/ti/project_config/ProjectConfig");

/**
 * Write custom configuration values to the imported modules.
 */
ADC121.$name                      = "ADC12_0";
ADC121.peripheral.$assign         = "ADC1";
ADC121.peripheral.adcPin0.$assign = "PA15";
ADC121.adcPin0Config.$name        = "ti_driverlib_gpio_GPIOPinGeneric32";

const Board = scripting.addModule("/ti/driverlib/Board", {}, false);

GPIO1.$name                               = "GPIO_GRP_ENCODER";
GPIO1.associatedPins.create(8);
GPIO1.associatedPins[0].direction         = "INPUT";
GPIO1.associatedPins[0].ioStructure       = "SD";
GPIO1.associatedPins[0].assignedPort      = "PORTB";
GPIO1.associatedPins[0].interruptEn       = true;
GPIO1.associatedPins[0].interruptPriority = "2";
GPIO1.associatedPins[0].polarity          = "RISE_FALL";
GPIO1.associatedPins[0].$name             = "PIN_MOTOR1_A";
GPIO1.associatedPins[1].direction         = "INPUT";
GPIO1.associatedPins[1].ioStructure       = "SD";
GPIO1.associatedPins[1].assignedPort      = "PORTB";
GPIO1.associatedPins[1].interruptEn       = true;
GPIO1.associatedPins[1].polarity          = "RISE_FALL";
GPIO1.associatedPins[1].interruptPriority = "2";
GPIO1.associatedPins[1].$name             = "PIN_MOTOR1_B";
GPIO1.associatedPins[2].direction         = "INPUT";
GPIO1.associatedPins[2].ioStructure       = "SD";
GPIO1.associatedPins[2].assignedPort      = "PORTB";
GPIO1.associatedPins[2].interruptEn       = true;
GPIO1.associatedPins[2].interruptPriority = "2";
GPIO1.associatedPins[2].polarity          = "RISE_FALL";
GPIO1.associatedPins[2].$name             = "PIN_MOTOR2_A";
GPIO1.associatedPins[3].direction         = "INPUT";
GPIO1.associatedPins[3].ioStructure       = "SD";
GPIO1.associatedPins[3].interruptEn       = true;
GPIO1.associatedPins[3].interruptPriority = "2";
GPIO1.associatedPins[3].polarity          = "RISE_FALL";
GPIO1.associatedPins[3].assignedPort      = "PORTB";
GPIO1.associatedPins[3].$name             = "PIN_MOTOR2_B";
GPIO1.associatedPins[4].direction         = "INPUT";
GPIO1.associatedPins[4].ioStructure       = "SD";
GPIO1.associatedPins[4].interruptEn       = true;
GPIO1.associatedPins[4].interruptPriority = "2";
GPIO1.associatedPins[4].polarity          = "RISE_FALL";
GPIO1.associatedPins[4].assignedPort      = "PORTB";
GPIO1.associatedPins[4].$name             = "PIN_MOTOR3_A";
GPIO1.associatedPins[5].direction         = "INPUT";
GPIO1.associatedPins[5].ioStructure       = "SD";
GPIO1.associatedPins[5].interruptEn       = true;
GPIO1.associatedPins[5].polarity          = "RISE_FALL";
GPIO1.associatedPins[5].assignedPort      = "PORTB";
GPIO1.associatedPins[5].$name             = "PIN_MOTOR3_B";
GPIO1.associatedPins[6].direction         = "INPUT";
GPIO1.associatedPins[6].ioStructure       = "SD";
GPIO1.associatedPins[6].assignedPort      = "PORTB";
GPIO1.associatedPins[6].interruptEn       = true;
GPIO1.associatedPins[6].polarity          = "RISE_FALL";
GPIO1.associatedPins[6].$name             = "PIN_MOTOR4_A";
GPIO1.associatedPins[7].direction         = "INPUT";
GPIO1.associatedPins[7].ioStructure       = "SD";
GPIO1.associatedPins[7].assignedPort      = "PORTB";
GPIO1.associatedPins[7].interruptEn       = true;
GPIO1.associatedPins[7].polarity          = "RISE_FALL";
GPIO1.associatedPins[7].interruptPriority = "2";
GPIO1.associatedPins[7].$name             = "PIN_MOTOR4_B";

GPIO2.$name                          = "GPIO_GRP_MCTRL";
GPIO2.associatedPins.create(8);
GPIO2.associatedPins[0].ioStructure  = "SD";
GPIO2.associatedPins[0].initialValue = "SET";
GPIO2.associatedPins[0].$name        = "PIN_MOTOR1_1";
GPIO2.associatedPins[0].pin.$assign  = "PB13";
GPIO2.associatedPins[1].ioStructure  = "SD";
GPIO2.associatedPins[1].initialValue = "SET";
GPIO2.associatedPins[1].$name        = "PIN_MOTOR1_2";
GPIO2.associatedPins[1].pin.$assign  = "PB17";
GPIO2.associatedPins[2].initialValue = "SET";
GPIO2.associatedPins[2].$name        = "PIN_MOTOR2_1";
GPIO2.associatedPins[2].pin.$assign  = "PA25";
GPIO2.associatedPins[3].initialValue = "SET";
GPIO2.associatedPins[3].$name        = "PIN_MOTOR2_2";
GPIO2.associatedPins[3].pin.$assign  = "PB26";
GPIO2.associatedPins[4].initialValue = "SET";
GPIO2.associatedPins[4].$name        = "PIN_MOTOR3_1";
GPIO2.associatedPins[4].pin.$assign  = "PB27";
GPIO2.associatedPins[5].initialValue = "SET";
GPIO2.associatedPins[5].$name        = "PIN_MOTOR3_2";
GPIO2.associatedPins[5].pin.$assign  = "PA5";
GPIO2.associatedPins[6].initialValue = "SET";
GPIO2.associatedPins[6].$name        = "PIN_MOTOR4_1";
GPIO2.associatedPins[6].pin.$assign  = "PA6";
GPIO2.associatedPins[7].initialValue = "SET";
GPIO2.associatedPins[7].$name        = "PIN_MOTOR4_2";
GPIO2.associatedPins[7].pin.$assign  = "PB1";

