Pansamic/ros2car_mspm0/Config/firmware.syscfg
PWM4.timerStartTimer                    = true;
PWM4.pwmMode                            = "EDGE_ALIGN_UP";
PWM4.$name                              = "PWM_1";
PWM4.peripheral.$assign                 = "TIMA1";
PWM4.peripheral.ccp0Pin.$assign         = "PB0";
PWM4.peripheral.ccp1Pin.$assign         = "PA24";
PWM4.PWM_CHANNEL_0.$name                = "ti_driverlib_pwm_PWMTimerCC6";
PWM4.PWM_CHANNEL_0.initVal              = "HIGH";
PWM4.PWM_CHANNEL_1.$name                = "ti_driverlib_pwm_PWMTimerCC7";
PWM4.PWM_CHANNEL_1.initVal              = "HIGH";
PWM4.ccp0PinConfig.direction            = scripting.forceWrite("OUTPUT");
PWM4.ccp0PinConfig.hideOutputInversion  = scripting.forceWrite(false);
PWM4.ccp0PinConfig.onlyInternalResistor = scripting.forceWrite(false);
PWM4.ccp0PinConfig.passedPeripheralType = scripting.forceWrite("Digital");
PWM4.ccp0PinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric27";
PWM4.ccp1PinConfig.direction            = scripting.forceWrite("OUTPUT");
PWM4.ccp1PinConfig.hideOutputInversion  = scripting.forceWrite(false);
PWM4.ccp1PinConfig.onlyInternalResistor = scripting.forceWrite(false);
PWM4.ccp1PinConfig.passedPeripheralType = scripting.forceWrite("Digital");
PWM4.ccp1PinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric28";

PWM5.pwmMode                            = "EDGE_ALIGN_UP";
PWM5.ccIndex                            = [0,1,2,3];
PWM5.$name                              = "PWM_SERVO";
PWM5.peripheral.$assign                 = "TIMA0";
PWM5.peripheral.ccp0Pin.$assign         = "PB14";
PWM5.peripheral.ccp1Pin.$assign         = "PA7";
PWM5.peripheral.ccp2Pin.$assign         = "PB12";
PWM5.peripheral.ccp3Pin.$assign         = "PA12";
PWM5.PWM_CHANNEL_0.$name                = "ti_driverlib_pwm_PWMTimerCC8";
PWM5.PWM_CHANNEL_1.$name                = "ti_driverlib_pwm_PWMTimerCC9";
PWM5.ccp0PinConfig.direction            = scripting.forceWrite("OUTPUT");
PWM5.ccp0PinConfig.hideOutputInversion  = scripting.forceWrite(false);
PWM5.ccp0PinConfig.onlyInternalResistor = scripting.forceWrite(false);
PWM5.ccp0PinConfig.passedPeripheralType = scripting.forceWrite("Digital");
PWM5.ccp0PinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric0";
PWM5.ccp1PinConfig.direction            = scripting.forceWrite("OUTPUT");
PWM5.ccp1PinConfig.hideOutputInversion  = scripting.forceWrite(false);
PWM5.ccp1PinConfig.onlyInternalResistor = scripting.forceWrite(false);
PWM5.ccp1PinConfig.passedPeripheralType = scripting.forceWrite("Digital");
PWM5.ccp1PinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric1";
PWM5.PWM_CHANNEL_2.$name                = "ti_driverlib_pwm_PWMTimerCC10";
PWM5.PWM_CHANNEL_3.$name                = "ti_driverlib_pwm_PWMTimerCC11";
PWM5.ccp2PinConfig.direction            = scripting.forceWrite("OUTPUT");
PWM5.ccp2PinConfig.hideOutputInversion  = scripting.forceWrite(false);
PWM5.ccp2PinConfig.onlyInternalResistor = scripting.forceWrite(false);
PWM5.ccp2PinConfig.passedPeripheralType = scripting.forceWrite("Digital");
PWM5.ccp2PinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric2";
PWM5.ccp3PinConfig.direction            = scripting.forceWrite("OUTPUT");
PWM5.ccp3PinConfig.hideOutputInversion  = scripting.forceWrite(false);
PWM5.ccp3PinConfig.onlyInternalResistor = scripting.forceWrite(false);
PWM5.ccp3PinConfig.passedPeripheralType = scripting.forceWrite("Digital");
PWM5.ccp3PinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric29";

RTC.calYear = 2025;
RTC.calDOW  = "3";

SPI1.$name                          = "SPI_0";
SPI1.rxFifoThreshold                = "DL_SPI_RX_FIFO_LEVEL_ONE_FRAME";
SPI1.txFifoThreshold                = "DL_SPI_TX_FIFO_LEVEL_ONE_FRAME";
SPI1.chipSelect                     = ["0","1"];
SPI1.targetBitRate                  = 1000000;
SPI1.peripheral.$assign             = "SPI0";
SPI1.peripheral.sclkPin.$assign     = "PA11";
SPI1.peripheral.mosiPin.$assign     = "PA14";
SPI1.peripheral.misoPin.$assign     = "PA10";
SPI1.peripheral.cs0Pin.$assign      = "PA8";
SPI1.peripheral.cs1Pin.$assign      = "PA3";
SPI1.sclkPinConfig.$name            = "ti_driverlib_gpio_GPIOPinGeneric3";
SPI1.mosiPinConfig.$name            = "ti_driverlib_gpio_GPIOPinGeneric4";
SPI1.misoPinConfig.$name            = "ti_driverlib_gpio_GPIOPinGeneric5";
SPI1.misoPinConfig.enableConfig     = true;
SPI1.misoPinConfig.internalResistor = "PULL_UP";
SPI1.cs0PinConfig.$name             = "ti_driverlib_gpio_GPIOPinGeneric6";
SPI1.cs1PinConfig.$name             = "ti_driverlib_gpio_GPIOPinGeneric30";

SPI2.$name                      = "SPI_1";
SPI2.chipSelect                 = ["0","1"];
SPI2.peripheral.$assign         = "SPI1";
SPI2.peripheral.sclkPin.$assign = "PB16";
SPI2.peripheral.mosiPin.$assign = "PB15";
SPI2.peripheral.misoPin.$assign = "PA16";
SPI2.peripheral.cs0Pin.$assign  = "PA2";
SPI2.peripheral.cs1Pin.$assign  = "PA27";
SPI2.sclkPinConfig.$name        = "ti_driverlib_gpio_GPIOPinGeneric15";
SPI2.mosiPinConfig.$name        = "ti_driverlib_gpio_GPIOPinGeneric16";
SPI2.misoPinConfig.$name        = "ti_driverlib_gpio_GPIOPinGeneric17";
SPI2.cs0PinConfig.$name         = "ti_driverlib_gpio_GPIOPinGeneric18";
SPI2.cs1PinConfig.$name         = "ti_driverlib_gpio_GPIOPinGeneric31";

SYSCTL.clockTreeEn = true;

TIMER1.timerMode          = "PERIODIC_UP";
TIMER1.timerStartTimer    = true;
TIMER1.timerClkDiv        = 4;
TIMER1.$name              = "TIMER_ENCODER";
TIMER1.interrupts         = ["OVERFLOW"];
TIMER1.interruptPriority  = "2";
TIMER1.timerPeriod        = "0";
TIMER1.peripheral.$assign = "TIMG12";

UART1.$name                            = "UART_2";
UART1.targetBaudRate                   = 921600;
UART1.rxFifoThreshold                  = "DL_UART_RX_FIFO_LEVEL_ONE_ENTRY";
UART1.txFifoThreshold                  = "DL_UART_TX_FIFO_LEVEL_ONE_ENTRY";
UART1.enableFIFO                       = true;
UART1.enabledDMARXTriggers             = "DL_UART_DMA_INTERRUPT_RX";
UART1.enabledDMATXTriggers             = "DL_UART_DMA_INTERRUPT_TX";
UART1.peripheral.$assign               = "UART2";
UART1.peripheral.rxPin.$assign         = "PA22";
UART1.peripheral.txPin.$assign         = "PA21";
UART1.txPinConfig.direction            = scripting.forceWrite("OUTPUT");
UART1.txPinConfig.hideOutputInversion  = scripting.forceWrite(false);
UART1.txPinConfig.onlyInternalResistor = scripting.forceWrite(false);
UART1.txPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
UART1.txPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric9";
UART1.rxPinConfig.hideOutputInversion  = scripting.forceWrite(false);
UART1.rxPinConfig.onlyInternalResistor = scripting.forceWrite(false);
UART1.rxPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
UART1.rxPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric10";
UART1.DMA_CHANNEL_RX.$name             = "DMA_UART2_RX";
UART1.DMA_CHANNEL_RX.addressMode       = "f2b";
UART1.DMA_CHANNEL_RX.srcLength         = "BYTE";
UART1.DMA_CHANNEL_RX.dstLength         = "BYTE";
UART1.DMA_CHANNEL_TX.$name             = "DMA_UART2_TX";
UART1.DMA_CHANNEL_TX.addressMode       = "b2f";
UART1.DMA_CHANNEL_TX.srcLength         = "BYTE";
UART1.DMA_CHANNEL_TX.dstLength         = "BYTE";

