Pansamic/ros2car_mspm0/Config/firmware.syscfg
UART2.$name                        = "UART_1";
UART2.targetBaudRate               = 921600;
UART2.enabledDMARXTriggers         = "DL_UART_DMA_INTERRUPT_RX";
UART2.enabledDMATXTriggers         = "DL_UART_DMA_INTERRUPT_TX";
UART2.enabledInterrupts            = ["DMA_DONE_RX","DMA_DONE_TX","EOT_DONE"];
UART2.peripheral.$assign           = "UART1";
UART2.peripheral.rxPin.$assign     = "PA18";
UART2.peripheral.txPin.$assign     = "PA17";
UART2.txPinConfig.$name            = "ti_driverlib_gpio_GPIOPinGeneric11";
UART2.rxPinConfig.$name            = "ti_driverlib_gpio_GPIOPinGeneric12";
UART2.rxPinConfig.internalResistor = "PULL_DOWN";
UART2.DMA_CHANNEL_RX.$name         = "DMA_UART1_RX";
UART2.DMA_CHANNEL_RX.addressMode   = "f2b";
UART2.DMA_CHANNEL_RX.srcLength     = "BYTE";
UART2.DMA_CHANNEL_RX.dstLength     = "BYTE";
UART2.DMA_CHANNEL_TX.$name         = "DMA_UART1_TX";
UART2.DMA_CHANNEL_TX.addressMode   = "b2f";
UART2.DMA_CHANNEL_TX.srcLength     = "BYTE";
UART2.DMA_CHANNEL_TX.dstLength     = "BYTE";

UART3.$name                            = "UART_0";
UART3.targetBaudRate                   = 921600;
UART3.enabledDMARXTriggers             = "DL_UART_DMA_INTERRUPT_RX";
UART3.enabledDMATXTriggers             = "DL_UART_DMA_INTERRUPT_TX";
UART3.enableFIFO                       = true;
UART3.rxFifoThreshold                  = "DL_UART_RX_FIFO_LEVEL_ONE_ENTRY";
UART3.txFifoThreshold                  = "DL_UART_TX_FIFO_LEVEL_ONE_ENTRY";
UART3.enabledInterrupts                = ["DMA_DONE_RX","DMA_DONE_TX","EOT_DONE"];
UART3.peripheral.$assign               = "UART0";
UART3.peripheral.rxPin.$assign         = "PA1";
UART3.peripheral.txPin.$assign         = "PA0";
UART3.txPinConfig.direction            = scripting.forceWrite("OUTPUT");
UART3.txPinConfig.hideOutputInversion  = scripting.forceWrite(false);
UART3.txPinConfig.onlyInternalResistor = scripting.forceWrite(false);
UART3.txPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
UART3.txPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric13";
UART3.rxPinConfig.hideOutputInversion  = scripting.forceWrite(false);
UART3.rxPinConfig.onlyInternalResistor = scripting.forceWrite(false);
UART3.rxPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
UART3.rxPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric14";
UART3.DMA_CHANNEL_RX.$name             = "DMA_UART0_RX";
UART3.DMA_CHANNEL_RX.srcLength         = "BYTE";
UART3.DMA_CHANNEL_RX.dstLength         = "BYTE";
UART3.DMA_CHANNEL_RX.addressMode       = "f2b";
UART3.DMA_CHANNEL_TX.$name             = "DMA_UART0_TX";
UART3.DMA_CHANNEL_TX.srcLength         = "BYTE";
UART3.DMA_CHANNEL_TX.dstLength         = "BYTE";
UART3.DMA_CHANNEL_TX.addressMode       = "b2f";

ProjectConfig.genLibCMSIS = true;

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
Board.peripheral.$suggestSolution                = "DEBUGSS";
Board.peripheral.swclkPin.$suggestSolution       = "PA20";
Board.peripheral.swdioPin.$suggestSolution       = "PA19";
GPIO1.associatedPins[0].pin.$suggestSolution     = "PB25";
GPIO1.associatedPins[1].pin.$suggestSolution     = "PB24";
GPIO1.associatedPins[2].pin.$suggestSolution     = "PB23";
GPIO1.associatedPins[3].pin.$suggestSolution     = "PB22";
GPIO1.associatedPins[4].pin.$suggestSolution     = "PB21";
GPIO1.associatedPins[5].pin.$suggestSolution     = "PB20";
GPIO1.associatedPins[6].pin.$suggestSolution     = "PB19";
GPIO1.associatedPins[7].pin.$suggestSolution     = "PB18";
RTC.peripheral.$suggestSolution                  = "RTC";
UART1.DMA_CHANNEL_RX.peripheral.$suggestSolution = "DMA_CH5";
UART1.DMA_CHANNEL_TX.peripheral.$suggestSolution = "DMA_CH4";
UART2.DMA_CHANNEL_RX.peripheral.$suggestSolution = "DMA_CH3";
UART2.DMA_CHANNEL_TX.peripheral.$suggestSolution = "DMA_CH2";
UART3.DMA_CHANNEL_RX.peripheral.$suggestSolution = "DMA_CH1";
UART3.DMA_CHANNEL_TX.peripheral.$suggestSolution = "DMA_CH0";
